{
    "class_name": "Sequential",
    "config": {
        "name": "sequential",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        5
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_1",
                    "size": 5
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 128,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "size": 128,
                    "input_shape": [
                        null,
                        5
                    ],
                    "output_shape": [
                        null,
                        128
                    ]
                },
                "weights": [
                    [
                        0.13722264766693115,
                        -0.11780308932065964,
                        -0.047649022191762924,
                        0.026795974001288414,
                        0.1956200748682022,
                        -0.33761176466941833,
                        0.002264832379296422,
                        0.21518351137638092,
                        -0.27397313714027405,
                        -0.251151978969574,
                        -0.17526955902576447,
                        0.24652384221553802,
                        0.11617355048656464,
                        -0.05586963891983032,
                        -0.053088344633579254,
                        0.26170453429222107,
                        0.003307993756607175,
                        0.009007183834910393,
                        0.007313912268728018,
                        -0.2262515425682068,
                        0.03381692245602608,
                        -0.40118321776390076,
                        -0.0848311111330986,
                        -0.007192987482994795,
                        0.07022084295749664,
                        0.08729934692382812,
                        -0.15988823771476746,
                        0.023572852835059166,
                        0.019312843680381775,
                        0.00991905853152275,
                        -0.17118914425373077,
                        -0.2138214409351349,
                        0.08496972918510437,
                        0.0025518150068819523,
                        0.14114582538604736,
                        0.06021774932742119,
                        -0.004859060049057007,
                        0.09034670889377594,
                        -0.057034194469451904,
                        -0.09936033189296722,
                        -0.02022126503288746,
                        0.004898752085864544,
                        0.06257960200309753,
                        0.18280421197414398,
                        -0.25813260674476624,
                        0.017089972272515297,
                        0.026914702728390694,
                        -0.001445421134121716,
                        0.1671333611011505,
                        0.22393907606601715,
                        -0.014112822711467743,
                        -0.21266473829746246,
                        0.0073228636756539345,
                        0.032730020582675934,
                        0.12744686007499695,
                        0.02941659651696682,
                        0.10609953105449677,
                        0.06586635857820511,
                        -0.09279578924179077,
                        -0.23928861320018768,
                        -0.01581697352230549,
                        0.020776065066456795,
                        0.10433708876371384,
                        -0.20928716659545898,
                        -0.1479896605014801,
                        -0.02746911533176899,
                        0.16227056086063385,
                        -0.025329839438199997,
                        0.0700041726231575,
                        0.33696532249450684,
                        0.017277589067816734,
                        -0.1022743433713913,
                        -0.12021881341934204,
                        0.0149056576192379,
                        0.1616268754005432,
                        -0.015917394310235977,
                        -0.13294059038162231,
                        0.038317080587148666,
                        -0.20761799812316895,
                        0.005507961381226778,
                        0.19411344826221466,
                        -0.12151017040014267,
                        -0.08754237741231918,
                        0.10021911561489105,
                        0.013336489908397198,
                        0.02283472940325737,
                        -0.0016714704688638449,
                        -0.008589795790612698,
                        -0.028339995071291924,
                        0.0985238328576088,
                        0.0648036003112793,
                        -0.14540231227874756,
                        -0.22369761765003204,
                        -0.13122528791427612,
                        -0.18093957006931305,
                        0.31144124269485474,
                        -0.3200753927230835,
                        -0.012493782676756382,
                        0.02517523244023323,
                        0.06235235556960106,
                        0.06038187816739082,
                        -0.0031936110462993383,
                        -0.11114826053380966,
                        0.22091208398342133,
                        0.042343806475400925,
                        0.011358490213751793,
                        0.14146089553833008,
                        -0.06900516897439957,
                        0.23465973138809204,
                        -0.298132061958313,
                        -0.016509724780917168,
                        -0.005506305024027824,
                        0.02390451729297638,
                        -0.01998153328895569,
                        0.05490982159972191,
                        -0.06780635565519333,
                        0.0014975554076954722,
                        0.1183311939239502,
                        0.11067183315753937,
                        -0.04010739177465439,
                        -0.05885067209601402,
                        -0.015138301998376846,
                        -0.07847651839256287,
                        -0.12673896551132202,
                        0.09220760315656662,
                        -0.2112002819776535,
                        0.05749126151204109,
                        0.0343785360455513
                    ],
                    [
                        0.06327303498983383,
                        0.042356736958026886,
                        0.39540624618530273,
                        0.23700971901416779,
                        0.36429473757743835,
                        -0.000341482664225623,
                        0.3023063838481903,
                        -0.12334475666284561,
                        -0.005248490255326033,
                        0.23420797288417816,
                        0.04512558504939079,
                        -0.009927519597113132,
                        -0.010772052221000195,
                        -0.13632732629776,
                        0.23733441531658173,
                        0.05180351436138153,
                        0.2189260870218277,
                        0.2906925678253174,
                        0.20279930531978607,
                        0.12991583347320557,
                        -0.08550315350294113,
                        -0.0007713271188549697,
                        -0.06919219344854355,
                        -0.264178603887558,
                        -0.03243568167090416,
                        0.022011037915945053,
                        -0.17861540615558624,
                        -0.20305439829826355,
                        -0.37420377135276794,
                        -0.3625560402870178,
                        -0.2870320975780487,
                        0.08484050631523132,
                        -0.39740464091300964,
                        0.1752338409423828,
                        -0.023479821160435677,
                        0.022715244442224503,
                        -0.1353815644979477,
                        -0.31433552503585815,
                        0.26723170280456543,
                        0.2230367511510849,
                        -0.030315347015857697,
                        -0.1726224720478058,
                        -0.18851585686206818,
                        0.2705179452896118,
                        -0.0015922122402116656,
                        0.015149894170463085,
                        0.18253079056739807,
                        -0.25413778424263,
                        -0.04021885246038437,
                        -0.4827898144721985,
                        -0.379242479801178,
                        -0.31240248680114746,
                        -0.17074888944625854,
                        0.04317718744277954,
                        0.4361128807067871,
                        0.29744425415992737,
                        0.23142161965370178,
                        -0.04504629597067833,
                        -0.08852072060108185,
                        -0.032586075365543365,
                        0.3521711528301239,
                        0.45068609714508057,
                        -0.17182239890098572,
                        0.022310836240649223,
                        0.11455141007900238,
                        0.15772393345832825,
                        0.0049560642801225185,
                        -0.09491296857595444,
                        -0.2214203178882599,
                        -0.0003728156443685293,
                        -0.17676252126693726,
                        -0.15330642461776733,
                        -0.012742084451019764,
                        0.2840145230293274,
                        0.19460035860538483,
                        -0.0025189141742885113,
                        0.10718528926372528,
                        0.267262727022171,
                        0.023625211790204048,
                        -0.13527721166610718,
                        0.18563294410705566,
                        -0.23217657208442688,
                        0.23901264369487762,
                        0.10077362507581711,
                        -0.07179820537567139,
                        -0.24226294457912445,
                        0.1601233035326004,
                        0.027045799419283867,
                        -0.08947590738534927,
                        -0.26271724700927734,
                        -0.04663819074630737,
                        -0.17671732604503632,
                        -0.2949369251728058,
                        0.11344998329877853,
                        0.07725831866264343,
                        -0.07092641294002533,
                        0.002665551844984293,
                        -0.2679474353790283,
                        0.4590469300746918,
                        -0.1424054205417633,
                        0.09599611163139343,
                        0.223185196518898,
                        0.05124090611934662,
                        0.053336430341005325,
                        -0.13177841901779175,
                        0.2475844770669937,
                        0.031813494861125946,
                        -0.2167455404996872,
                        -0.14888080954551697,
                        -1.8447695765644312e-05,
                        0.22154498100280762,
                        -0.039493102580308914,
                        0.1722000539302826,
                        0.051995567977428436,
                        -0.03721460700035095,
                        -0.12221226096153259,
                        -0.05060640722513199,
                        -0.24067257344722748,
                        0.05151898041367531,
                        -0.23873621225357056,
                        0.024423105642199516,
                        -0.5308346152305603,
                        -0.10723144561052322,
                        0.2548258304595947,
                        0.12043344974517822,
                        -0.03441406041383743,
                        -0.003971213009208441,
                        -0.38883307576179504
                    ],
                    [
                        -0.056766577064991,
                        -0.10127527266740799,
                        -0.22262316942214966,
                        0.049941837787628174,
                        -0.3113468289375305,
                        -0.0021607251837849617,
                        0.019145652651786804,
                        -0.23410440981388092,
                        -0.021136971190571785,
                        0.005329969339072704,
                        0.09753957390785217,
                        0.019373057410120964,
                        -0.005167053546756506,
                        0.14171050488948822,
                        0.30578741431236267,
                        -0.17042572796344757,
                        -0.21072280406951904,
                        -0.14608998596668243,
                        -0.21313993632793427,
                        -0.16500438749790192,
                        0.0609106719493866,
                        -0.0008996828692033887,
                        -0.16971378028392792,
                        0.27723610401153564,
                        -0.0705546960234642,
                        0.0030357972718775272,
                        0.15934622287750244,
                        -0.23012672364711761,
                        -0.07216370850801468,
                        0.07216024398803711,
                        0.02063460275530815,
                        0.030483638867735863,
                        0.21470658481121063,
                        -0.18295930325984955,
                        -0.02655091881752014,
                        -0.0009970746468752623,
                        0.13966809213161469,
                        0.32040706276893616,
                        0.03529742732644081,
                        -0.07507630437612534,
                        0.06620484590530396,
                        0.1953565925359726,
                        0.36971428990364075,
                        0.06684407591819763,
                        -0.024792199954390526,
                        -0.18678659200668335,
                        -0.2625979483127594,
                        -0.049543607980012894,
                        -0.10797896236181259,
                        0.06984375417232513,
                        0.004524867050349712,
                        0.006475129630416632,
                        0.20314861834049225,
                        -0.019748590886592865,
                        0.025918925181031227,
                        0.2448204755783081,
                        0.3235137462615967,
                        0.19309458136558533,
                        -0.0025220077950507402,
                        -0.040138766169548035,
                        -0.2445651888847351,
                        -0.42628517746925354,
                        0.1387544572353363,
                        -0.09184190630912781,
                        0.12055335193872452,
                        -0.20382484793663025,
                        -0.0038028520066291094,
                        0.3588808476924896,
                        -0.1220257356762886,
                        0.0006511624669656157,
                        -0.3024772107601166,
                        -0.017292415723204613,
                        -0.17615994811058044,
                        -0.2513311207294464,
                        -0.4301197826862335,
                        -0.001013849745504558,
                        0.4191112220287323,
                        -0.08836206793785095,
                        -0.006710049230605364,
                        0.14827817678451538,
                        -0.10175671428442001,
                        0.2103295773267746,
                        -0.1859702169895172,
                        0.1903497874736786,
                        -0.10226302593946457,
                        -0.03747017681598663,
                        -0.1885129064321518,
                        -0.019549427554011345,
                        0.31309184432029724,
                        0.6122779846191406,
                        -0.14189259707927704,
                        0.17342735826969147,
                        -0.06943707913160324,
                        0.06932955235242844,
                        -0.16928605735301971,
                        0.04022074490785599,
                        -0.0032841814681887627,
                        0.08332624286413193,
                        0.02579141966998577,
                        -0.40862107276916504,
                        -0.03770596534013748,
                        -0.20553773641586304,
                        -0.019412580877542496,
                        -0.015440981835126877,
                        -0.001067714998498559,
                        0.2576674222946167,
                        -0.17494042217731476,
                        -0.12685109674930573,
                        -0.08252131193876266,
                        0.001984319183975458,
                        -0.16516639292240143,
                        -0.18611657619476318,
                        0.019536267966032028,
                        0.11153721809387207,
                        -0.2778482139110565,
                        0.1538872867822647,
                        0.3859618008136749,
                        -0.03814147412776947,
                        0.17121338844299316,
                        -0.08787396550178528,
                        0.09012564271688461,
                        -0.22675761580467224,
                        -0.1338874101638794,
                        -0.25165441632270813,
                        0.25868022441864014,
                        -0.0823560357093811,
                        -0.3291810154914856,
                        -0.01757131516933441
                    ],
                    [
                        -0.23460479080677032,
                        -0.09525065124034882,
                        -0.009011081419885159,
                        -0.12323800474405289,
                        0.014158587902784348,
                        -0.00014097818348091096,
                        0.03981887921690941,
                        -0.04200958460569382,
                        -0.019121894612908363,
                        -0.07664136588573456,
                        0.013479379937052727,
                        0.0010782459285110235,
                        0.26278895139694214,
                        -0.09552749991416931,
                        0.03859671205282211,
                        -0.19997617602348328,
                        -0.040961526334285736,
                        -0.02043394185602665,
                        -0.027355609461665154,
                        0.00018353819905314595,
                        0.15659025311470032,
                        0.0013019625330343843,
                        -0.04414714127779007,
                        -0.06010022014379501,
                        0.02349630370736122,
                        0.10392038524150848,
                        -0.031309109181165695,
                        0.19684810936450958,
                        0.07975611090660095,
                        0.08551226556301117,
                        -0.013956130482256413,
                        -0.03496465086936951,
                        -0.03169579803943634,
                        -0.0018432262586429715,
                        -0.17098836600780487,
                        0.0034589315764606,
                        0.008308732882142067,
                        0.14701536297798157,
                        0.0683274120092392,
                        -0.013373903930187225,
                        -0.20366354286670685,
                        -0.02896185591816902,
                        -0.02648417092859745,
                        -0.1185363382101059,
                        -0.019548766314983368,
                        0.015085474587976933,
                        0.04640527442097664,
                        0.051081981509923935,
                        -0.17078721523284912,
                        -0.010595287196338177,
                        0.001920604845508933,
                        -9.316272917203605e-05,
                        -0.019370822235941887,
                        0.06066984683275223,
                        0.09013792872428894,
                        0.18663905560970306,
                        -0.11529988050460815,
                        0.04704420268535614,
                        0.2037694901227951,
                        0.07732543349266052,
                        -0.01649169996380806,
                        0.011768731288611889,
                        -0.09394359588623047,
                        0.30382129549980164,
                        -0.033384498208761215,
                        -0.05800649896264076,
                        -0.018068499863147736,
                        0.11174356192350388,
                        -0.004062053747475147,
                        -0.0008605202310718596,
                        0.015808377414941788,
                        -0.07493886351585388,
                        0.09258998185396194,
                        0.021537868306040764,
                        0.05001147463917732,
                        0.1744886338710785,
                        0.12438918650150299,
                        -0.058463696390390396,
                        0.17766621708869934,
                        -0.006247406359761953,
                        -0.020803742110729218,
                        0.08478367328643799,
                        0.06878870725631714,
                        0.0526713989675045,
                        -0.004246499855071306,
                        -0.10361971706151962,
                        -0.08204355090856552,
                        0.010220162570476532,
                        -0.006295267958194017,
                        0.02706814743578434,
                        -0.13169889152050018,
                        -0.043252408504486084,
                        0.12628045678138733,
                        0.13109110295772552,
                        -0.03892216458916664,
                        0.02982334792613983,
                        0.0006053008255548775,
                        -0.02879609353840351,
                        0.1118011623620987,
                        -0.014620901085436344,
                        -0.010179308243095875,
                        -0.05828284099698067,
                        0.11698345094919205,
                        0.0052779982797801495,
                        0.1846158355474472,
                        -0.14108900725841522,
                        0.06433060765266418,
                        -0.025793064385652542,
                        -0.1706993132829666,
                        0.0007347857463173568,
                        0.15523406863212585,
                        0.1065899208188057,
                        0.17255127429962158,
                        0.14480943977832794,
                        0.07500190287828445,
                        -0.04093252867460251,
                        -0.18282200396060944,
                        0.13045744597911835,
                        0.13123060762882233,
                        -0.07018841058015823,
                        -0.27657532691955566,
                        0.16084636747837067,
                        -0.01961437426507473,
                        0.01071513444185257,
                        0.01984751969575882,
                        0.14173051714897156,
                        -0.004635801538825035,
                        0.06856599450111389
                    ],
                    [
                        -0.04464045166969299,
                        0.11202849447727203,
                        -0.06335501372814178,
                        0.11853969842195511,
                        -0.16480803489685059,
                        -0.00014871775056235492,
                        -0.01725570298731327,
                        -0.012535874731838703,
                        0.02010941505432129,
                        0.03786087781190872,
                        -0.008178051561117172,
                        -0.000725048128515482,
                        -0.2815404236316681,
                        -0.0010344741167500615,
                        -0.0477321520447731,
                        -0.19293212890625,
                        0.023227542638778687,
                        0.03713745251297951,
                        0.006868347059935331,
                        -0.050092656165361404,
                        -0.06199586018919945,
                        0.0009231104631908238,
                        -0.09362456202507019,
                        0.06721369177103043,
                        -0.0354795828461647,
                        -0.20420685410499573,
                        0.02079043909907341,
                        -0.030983062461018562,
                        -0.012502704747021198,
                        -0.12083180248737335,
                        0.044821541756391525,
                        -0.01558233518153429,
                        -0.13431605696678162,
                        -0.008584799244999886,
                        0.1565406620502472,
                        -0.07843928039073944,
                        -0.008282379247248173,
                        -0.03359350562095642,
                        -0.035165540874004364,
                        0.06200087442994118,
                        0.05830911174416542,
                        0.02444268949329853,
                        0.24402795732021332,
                        0.07769031822681427,
                        0.008942053653299809,
                        -0.09641730040311813,
                        -0.10102763026952744,
                        -0.08315816521644592,
                        0.14625301957130432,
                        -0.04097919538617134,
                        0.010387465357780457,
                        0.03186218440532684,
                        0.004374190233647823,
                        -0.030838564038276672,
                        -0.11032740771770477,
                        -0.07239910960197449,
                        -0.0001815549039747566,
                        -0.10974991321563721,
                        0.05062041059136391,
                        -0.04227731376886368,
                        -0.04011048749089241,
                        0.05641123279929161,
                        -0.0299769788980484,
                        -0.27508896589279175,
                        -0.06113694980740547,
                        0.033671069890260696,
                        0.05477338656783104,
                        -0.03797426447272301,
                        -0.06284057348966599,
                        -0.0011551490752026439,
                        0.0335257388651371,
                        -0.0015106580685824156,
                        0.08448324352502823,
                        0.024858903139829636,
                        0.07389796525239944,
                        0.0030798681546002626,
                        -0.1681482344865799,
                        0.02411780320107937,
                        0.015734151005744934,
                        -0.0026381576899439096,
                        0.07361410558223724,
                        -0.09006376564502716,
                        0.18937139213085175,
                        0.0964326560497284,
                        0.034581780433654785,
                        -0.09104101359844208,
                        0.09618062525987625,
                        0.13813012838363647,
                        -0.010618259198963642,
                        -0.17135091125965118,
                        0.008186603896319866,
                        0.04828862100839615,
                        -0.04763665050268173,
                        -0.060282908380031586,
                        0.015411038883030415,
                        -0.025432469323277473,
                        -0.00037083099596202374,
                        0.020559396594762802,
                        -0.09713534265756607,
                        -0.01731431856751442,
                        -0.025391818955540657,
                        0.00310158240608871,
                        0.1457212269306183,
                        -0.37017083168029785,
                        0.06298419833183289,
                        0.021639345213770866,
                        -0.034149520099163055,
                        0.07649610191583633,
                        0.12704330682754517,
                        0.0005089188925921917,
                        -0.01329310517758131,
                        -0.07553404569625854,
                        -0.05633940175175667,
                        0.03925786912441254,
                        -0.030411336570978165,
                        0.06486277282238007,
                        0.17693494260311127,
                        -0.03228642791509628,
                        -0.1432405263185501,
                        0.09112527221441269,
                        0.1958218514919281,
                        -0.2038005292415619,
                        -0.03391354903578758,
                        -0.04959767311811447,
                        -0.11107003688812256,
                        -0.04609246551990509,
                        -0.00040714835631661117,
                        -0.009770995005965233
                    ]
                ],
                "biases": [
                    0.00682496652007103,
                    0.0012517934665083885,
                    0.0335262231528759,
                    0.12097206711769104,
                    0.10646910965442657,
                    -0.3299294412136078,
                    -0.027370762079954147,
                    0.21630577743053436,
                    -0.05356961116194725,
                    -0.004549568053334951,
                    -0.01969005912542343,
                    0.23892709612846375,
                    0.08953392505645752,
                    0.03191906958818436,
                    -0.20417658984661102,
                    0.022527426481246948,
                    0.1654265969991684,
                    0.15703238546848297,
                    0.18915607035160065,
                    -0.19442781805992126,
                    0.10142740607261658,
                    -0.37873682379722595,
                    0.011172951199114323,
                    0.15374676883220673,
                    0.19622330367565155,
                    0.12494868785142899,
                    0.09736057370901108,
                    0.101753368973732,
                    0.10029282420873642,
                    -0.01960088312625885,
                    0.08217483013868332,
                    -0.10170283168554306,
                    0.00017262432083953172,
                    0.1863524168729782,
                    0.10533285140991211,
                    0.1518947035074234,
                    0.1444123536348343,
                    -0.0845194011926651,
                    0.06315464526414871,
                    0.08084430545568466,
                    -0.07174599915742874,
                    0.15106363594532013,
                    -0.024466482922434807,
                    0.1193140372633934,
                    -0.10193603485822678,
                    0.11230603605508804,
                    0.1897873431444168,
                    0.03520175814628601,
                    0.1857883185148239,
                    -0.17087063193321228,
                    0.01075822301208973,
                    0.011204006150364876,
                    0.16773755848407745,
                    0.12670095264911652,
                    0.07655377686023712,
                    -0.02678089402616024,
                    0.1402970254421234,
                    0.19879265129566193,
                    0.1352083534002304,
                    -0.10807353258132935,
                    0.14205756783485413,
                    -0.3323134183883667,
                    0.12125945836305618,
                    -0.04661845043301582,
                    -0.03546120226383209,
                    0.10411765426397324,
                    0.15283340215682983,
                    -0.008013490587472916,
                    0.0967499315738678,
                    0.3072517216205597,
                    0.0669109970331192,
                    0.029938848689198494,
                    0.037578776478767395,
                    -0.15120941400527954,
                    0.0013451682170853019,
                    0.165534108877182,
                    0.015066423453390598,
                    0.25805649161338806,
                    -0.054307665675878525,
                    0.14097629487514496,
                    0.1185905784368515,
                    0.04420691728591919,
                    0.07199723273515701,
                    0.0701744481921196,
                    0.13431985676288605,
                    -0.009249821305274963,
                    0.11203208565711975,
                    0.14358069002628326,
                    -0.031170427799224854,
                    -0.04684321582317352,
                    0.06397347152233124,
                    0.06350944191217422,
                    -0.05931932479143143,
                    0.05538881942629814,
                    0.008683252148330212,
                    0.23423124849796295,
                    -0.2783884108066559,
                    0.08015365153551102,
                    0.0867169126868248,
                    -0.05589304864406586,
                    0.13051128387451172,
                    0.15889786183834076,
                    0.11996812373399734,
                    -0.007627611048519611,
                    0.12072757631540298,
                    0.13949553668498993,
                    0.15063361823558807,
                    0.08962889015674591,
                    0.04946064576506615,
                    -0.2864210307598114,
                    -0.06454920768737793,
                    0.08490101248025894,
                    0.10246158391237259,
                    0.1632733792066574,
                    0.08395298570394516,
                    0.15581803023815155,
                    0.004773360211402178,
                    0.12811699509620667,
                    0.1088058352470398,
                    0.07707590609788895,
                    -0.2910279333591461,
                    -0.1686127632856369,
                    0.015333750285208225,
                    0.10154958069324493,
                    0.05814899504184723,
                    0.03359203785657883,
                    0.056051112711429596,
                    0.012737993150949478
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 128,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "size": 128,
                    "input_shape": [
                        null,
                        128
                    ],
                    "output_shape": [
                        null,
                        128
                    ]
                },
                "weights": [
                    [
                        -0.12027288228273392,
                        0.03266715258359909,
                        0.17439867556095123,
                        0.04560304805636406,
                        0.12045357376337051,
                        0.04062111675739288,
                        -0.03459419310092926,
                        0.11292102187871933,
                        -0.10900810360908508,
                        0.08910654485225677,
                        0.1519363522529602,
                        0.0632665604352951,
                        0.07756883651018143,
                        0.06265377253293991,
                        -0.00012726052955258638,
                        -0.06664358079433441,
                        0.013572893105447292,
                        0.040293559432029724,
                        0.10576893389225006,
                        -0.08052439242601395,
                        0.09260815382003784,
                        0.13468575477600098,
                        0.06709396094083786,
                        0.1353510320186615,
                        0.11930658668279648,
                        -0.03638439252972603,
                        0.06306130439043045,
                        0.03296281397342682,
                        0.07028497755527496,
                        -0.06460711359977722,
                        -0.14968155324459076,
                        -0.11676494777202606,
                        -0.08508899062871933,
                        0.053631264716386795,
                        0.13173027336597443,
                        0.14917756617069244,
                        -0.03770402446389198,
                        0.02245284430682659,
                        -0.15186943113803864,
                        0.03618234768509865,
                        0.08072744309902191,
                        -0.08561919629573822,
                        0.12756846845149994,
                        -0.028328513726592064,
                        0.012532638385891914,
                        0.02591210976243019,
                        0.06976296752691269,
                        0.15945085883140564,
                        -0.011977489106357098,
                        0.12313761562108994,
                        -0.11633516848087311,
                        -0.05996936932206154,
                        0.05852152779698372,
                        0.005068802274763584,
                        0.030271558091044426,
                        0.27917423844337463,
                        -0.07403913140296936,
                        0.014070258475840092,
                        0.03256285563111305,
                        0.027476487681269646,
                        0.07233656942844391,
                        -0.13746099174022675,
                        -0.0059892660938203335,
                        -0.007026199251413345,
                        -0.06408336758613586,
                        -0.13223157823085785,
                        0.1003020703792572,
                        -0.12407612055540085,
                        0.016808845102787018,
                        -0.1028464287519455,
                        -0.08876646310091019,
                        -0.21743451058864594,
                        -0.013680038042366505,
                        0.18089346587657928,
                        -0.0005418506334535778,
                        -0.05353042110800743,
                        0.10344595462083817,
                        0.09633190929889679,
                        -0.15133577585220337,
                        0.24498818814754486,
                        -0.06136826425790787,
                        0.024897519499063492,
                        -0.035234641283750534,
                        0.10053762793540955,
                        0.02397838607430458,
                        -0.18807223439216614,
                        -0.056440990418195724,
                        -0.1910182684659958,
                        0.04165312275290489,
                        0.10351622849702835,
                        0.07718389481306076,
                        0.12910939753055573,
                        0.09485448151826859,
                        -0.04422128200531006,
                        -0.07641894370317459,
                        0.016112443059682846,
                        0.07620637118816376,
                        0.02240719459950924,
                        0.10373669862747192,
                        -0.03301331028342247,
                        -0.05238215625286102,
                        0.06287643313407898,
                        0.12325456738471985,
                        -0.13951127231121063,
                        -0.190201535820961,
                        0.024996858090162277,
                        0.06992127001285553,
                        -0.09985819458961487,
                        -0.06301521509885788,
                        0.04133394733071327,
                        -0.30606722831726074,
                        0.008998144418001175,
                        -0.0976744219660759,
                        0.17089693248271942,
                        0.07774119824171066,
                        0.21587826311588287,
                        0.022487832233309746,
                        -0.058352358639240265,
                        0.3781615197658539,
                        0.10736017674207687,
                        -0.12224191427230835,
                        0.05615384876728058,
                        0.1704394817352295,
                        0.005733125377446413,
                        0.14442986249923706,
                        0.1914021223783493,
                        -0.27923905849456787,
                        0.13978570699691772
                    ],
                    [
                        -0.10865070670843124,
                        -0.06790900975465775,
                        -0.05307205393910408,
                        0.030121268704533577,
                        -0.1621747463941574,
                        0.13435369729995728,
                        0.0286721121519804,
                        -0.1707243174314499,
                        -0.09871445596218109,
                        -0.09966474026441574,
                        -0.115248903632164,
                        -0.07437517493963242,
                        0.1215723529458046,
                        0.014677122235298157,
                        0.07209951430559158,
                        0.0011030944297090173,
                        -0.13588589429855347,
                        -0.0034001145977526903,
                        0.040511585772037506,
                        -0.03920773044228554,
                        0.2455529123544693,
                        0.003999656997621059,
                        0.1378079205751419,
                        -0.09894172847270966,
                        0.0668623074889183,
                        0.01239778846502304,
                        -0.10357459634542465,
                        0.014725347980856895,
                        0.0214314553886652,
                        0.014956836588680744,
                        0.03323899582028389,
                        0.016811609268188477,
                        -0.2062733769416809,
                        -0.22574067115783691,
                        0.054936733096838,
                        -0.15302146971225739,
                        0.07571142911911011,
                        -0.1693001240491867,
                        -0.0971333384513855,
                        0.012339480221271515,
                        -0.027330933138728142,
                        -0.016003668308258057,
                        0.015949400141835213,
                        0.089461550116539,
                        -0.11642034351825714,
                        -0.08921429514884949,
                        0.027940483763813972,
                        -0.044023387134075165,
                        -0.05021577700972557,
                        -0.06474665552377701,
                        0.048464708030223846,
                        -0.015225104056298733,
                        0.09414570033550262,
                        -0.02818027138710022,
                        -0.10754965245723724,
                        -0.139615997672081,
                        -0.006378826219588518,
                        0.16880623996257782,
                        0.0716809332370758,
                        0.022845111787319183,
                        0.08082526177167892,
                        -0.0635686069726944,
                        0.06909102201461792,
                        0.004752650856971741,
                        -0.024100031703710556,
                        -0.43815767765045166,
                        0.056530531495809555,
                        0.0280887670814991,
                        0.054840728640556335,
                        0.057018592953681946,
                        -0.07445566356182098,
                        -0.11938797682523727,
                        -0.01410461962223053,
                        -0.02123136818408966,
                        -0.029391326010227203,
                        -0.135080486536026,
                        0.12537112832069397,
                        -0.2465915083885193,
                        -0.0008996115648187697,
                        -0.03499423712491989,
                        0.08584228903055191,
                        -0.01571004092693329,
                        -0.028503911569714546,
                        0.02347693219780922,
                        -0.004446063656359911,
                        0.07866609841585159,
                        -0.1200563833117485,
                        -0.0324275866150856,
                        -0.061816588044166565,
                        -0.23068809509277344,
                        0.037213895469903946,
                        0.1029205247759819,
                        0.00024923705495893955,
                        0.20679597556591034,
                        -0.03833242133259773,
                        0.14326322078704834,
                        -0.09033701568841934,
                        0.11723271757364273,
                        0.10042273998260498,
                        0.06117907539010048,
                        0.05585469678044319,
                        0.12898202240467072,
                        0.024868354201316833,
                        0.05040094628930092,
                        -0.2163076102733612,
                        0.009749681688845158,
                        -0.022692454978823662,
                        -0.05079963058233261,
                        -0.051236592233181,
                        -0.16796423494815826,
                        -0.03770415857434273,
                        -0.05313560366630554,
                        -0.05614960938692093,
                        -0.11936474591493607,
                        -0.01895032450556755,
                        0.10455497354269028,
                        0.031716443598270416,
                        0.00703663332387805,
                        -0.2749426066875458,
                        -0.059847861528396606,
                        0.020604200661182404,
                        -0.0815695971250534,
                        -0.01377034466713667,
                        -0.2092156708240509,
                        0.05688460171222687,
                        0.10274139046669006,
                        -0.16001476347446442,
                        0.041364822536706924
                    ],
                    [
                        0.026799116283655167,
                        -0.1823185235261917,
                        0.22979843616485596,
                        -0.1499345451593399,
                        0.004641236271709204,
                        -0.08529100567102432,
                        0.04392033815383911,
                        -0.09843876212835312,
