{
    "class_name": "Functional",
    "config": {
        "name": "model_1",
        "trainable": true,
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        10,
                        10,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_2",
                    "idx": 0,
                    "size": 300,
                    "input_shape": [
                        null,
                        3,
                        10,
                        10
                    ],
                    "output_shape": [
                        null,
                        3,
                        10,
                        10
                    ],
                    "prev_layer_idx": [
                        -1
                    ]
                },
                "name": "input_2",
                "inbound_nodes": []
            },
            {
                "class_name": "AveragePooling2D",
                "config": {
                    "name": "average_pooling2d",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        3,
                        3
                    ],
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "data_format": "channels_last",
                    "idx": 1,
                    "size": 192,
                    "input_shape": [
                        null,
                        3,
                        10,
                        10
                    ],
                    "output_shape": [
                        null,
                        3,
                        8,
                        8
                    ],
                    "prev_layer_idx": [
                        0
                    ]
                },
                "name": "average_pooling2d",
                "inbound_nodes": [
                    [
                        [
                            "input_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_2",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "average_pooling2d",
                0,
                0
            ]
        ],
        "data_format": "channels_last"
    },
    "keras_version": "2.12.0",
    "backend": "tensorflow"
}