{
    "class_name": "Sequential",
    "config": {
        "name": "sequential",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        28,
                        28,
                        1
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_input",
                    "size": 784
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d",
                    "trainable": true,
                    "batch_input_shape": [
                        null,
                        28,
                        28,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 6,
                    "kernel_size": [
                        5,
                        5
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "tanh",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "size": 3456,
                    "input_shape": [
                        null,
                        28,
                        28,
                        1
                    ],
                    "output_shape": [
                        null,
                        24,
                        24,
                        6
                    ]
                },
                "weights": [
                    [
                        [
                            [
                                -0.02027183584868908,
                                -0.29244548082351685,
                                0.08360002189874649,
                                -0.05501323193311691,
                                0.11084172874689102,
                                -0.2865172028541565
                            ]
                        ],
                        [
                            [
                                -0.33686041831970215,
                                0.43188396096229553,
                                -0.08925824612379074,
                                -0.08172988891601562,
                                -0.06417421996593475,
                                -0.25449731945991516
                            ]
                        ],
                        [
                            [
                                -0.13834300637245178,
                                0.5119174718856812,
                                -0.12123791128396988,
                                -0.1646280288696289,
                                -0.35016515851020813,
                                -0.28186729550361633
                            ]
                        ],
                        [
                            [
                                -0.3628292977809906,
                                0.4379956126213074,
                                -0.31211182475090027,
                                -0.4878621995449066,
                                -0.14178112149238586,
                                -0.38686349987983704
                            ]
                        ],
                        [
                            [
                                -0.143778458237648,
                                -0.09359653294086456,
                                -0.10083623975515366,
                                -0.3373945951461792,
                                -0.25863775610923767,
                                -0.22479961812496185
                            ]
                        ]
                    ],
                    [
                        [
                            [
                                -0.13058246672153473,
                                0.04332200065255165,
                                0.1307065486907959,
                                -0.04839358106255531,
                                -0.1359640210866928,
                                -0.4012698233127594
                            ]
                        ],
                        [
                            [
                                0.07078332453966141,
                                0.697422206401825,
                                0.03429262712597847,
                                -0.3467128574848175,
                                -0.07033371925354004,
                                -0.4877854883670807
                            ]
                        ],
                        [
                            [
                                0.13476289808750153,
                                0.5213904976844788,
                                -0.1105755940079689,
                                -0.4010867476463318,
                                -0.20719103515148163,
                                -0.11921992152929306
                            ]
                        ],
                        [
                            [
                                -0.024797644466161728,
                                0.14188559353351593,
                                -0.14816999435424805,
                                -0.49249154329299927,
                                -0.3726407587528229,
                                0.05729560926556587
                            ]
                        ],
                        [
                            [
                                0.08921578526496887,
                                -0.2936681807041168,
                                -0.05296311154961586,
                                -0.2120097279548645,
                                -0.24810078740119934,
                                0.283820241689682
                            ]
                        ]
                    ],
                    [
                        [
                            [
                                0.3840329051017761,
                                0.27371105551719666,
                                0.09728097915649414,
                                0.08584625273942947,
                                0.40477508306503296,
                                -0.104047991335392
                            ]
                        ],
                        [
                            [
                                0.497301310300827,
                                0.8471136689186096,
                                0.37467628717422485,
                                -0.25053974986076355,
                                0.31840184330940247,
                                0.08367639780044556
                            ]
                        ],
                        [
                            [
                                0.34804049134254456,
                                0.3542182147502899,
                                -0.056993041187524796,
                                -0.20751194655895233,
                                0.2925717532634735,
                                0.4373937249183655
                            ]
                        ],
                        [
                            [
                                0.5404384136199951,
                                0.092776358127594,
                                -0.08776895701885223,
                                0.10447821766138077,
                                0.24906378984451294,
                                0.5607408881187439
                            ]
                        ],
                        [
                            [
                                0.2956712543964386,
                                -0.26176318526268005,
                                -0.20848460495471954,
                                -0.027218878269195557,
                                0.003914432600140572,
                                0.4555334746837616
                            ]
                        ]
                    ],
                    [
                        [
                            [
                                0.24962809681892395,
                                0.3907245397567749,
                                0.10957947373390198,
                                -0.004719863645732403,
                                0.43723374605178833,
                                -0.1148703321814537
                            ]
                        ],
                        [
                            [
                                0.4385698139667511,
                                0.43814322352409363,
                                0.3883652687072754,
                                0.2564598023891449,
                                0.46610942482948303,
                                0.2925008535385132
                            ]
                        ],
                        [
                            [
                                0.7080074548721313,
                                0.0253701563924551,
                                0.03575107455253601,
                                0.23259443044662476,
                                0.700867772102356,
                                0.3841609060764313
                            ]
                        ],
                        [
                            [
                                0.5912368893623352,
                                -0.3310033679008484,
                                -0.01834104023873806,
                                0.3181263208389282,
                                0.627041757106781,
                                0.3685421049594879
                            ]
                        ],
                        [
                            [
                                0.25714993476867676,
                                -0.3394031524658203,
                                0.10014133155345917,
                                0.03136729076504707,
                                0.5084496140480042,
                                0.36073142290115356
                            ]
                        ]
                    ],
                    [
                        [
                            [
                                -0.20121514797210693,
                                0.49339163303375244,
                                0.1981615126132965,
                                0.4172447919845581,
                                0.006400479469448328,
                                -0.3171449601650238
                            ]
                        ],
                        [
                            [
                                -0.04534795135259628,
                                0.21423539519309998,
                                0.184046670794487,
                                0.41633370518684387,
                                -0.18742914497852325,
                                -0.09963071346282959
                            ]
                        ],
                        [
                            [
                                -0.004185149911791086,
                                -0.07702387124300003,
                                0.08032947033643723,
                                0.2919215261936188,
                                -0.11342393606901169,
                                0.011957243084907532
                            ]
                        ],
                        [
                            [
                                -0.14384281635284424,
                                -0.24745044112205505,
                                -0.07873586565256119,
                                0.19078539311885834,
                                0.20829150080680847,
                                0.18497659265995026
                            ]
                        ],
                        [
                            [
                                0.10123858600854874,
                                -0.28332674503326416,
                                0.08089260756969452,
                                0.3293551504611969,
                                0.16360777616500854,
                                0.04576192423701286
                            ]
                        ]
                    ]
                ],
                "biases": [
                    -0.16464535892009735,
                    -0.026044394820928574,
                    -0.09863532334566116,
                    0.11930935084819794,
                    -0.11974819749593735,
                    -0.1461077332496643
                ]
            },
            {
                "class_name": "AveragePooling2D",
                "config": {
                    "name": "average_pooling2d",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last",
                    "size": 864,
                    "input_shape": [
                        null,
                        24,
                        24,
                        6
                    ],
                    "output_shape": [
                        null,
                        12,
                        12,
                        6
                    ]
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [
                        5,
                        5
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "tanh",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "size": 1024,
                    "input_shape": [
                        null,
                        12,
                        12,
                        6
                    ],
                    "output_shape": [
                        null,
                        8,
                        8,
                        16
                    ]
                },
                "weights": [
                    [
                        [
                            [
                                -0.04673594981431961,
                                0.06358987838029861,
                                0.19858478009700775,
                                -0.2007007598876953,
                                0.011093190871179104,
                                -0.08575887233018875,
                                -0.1330193430185318,
                                0.11315790563821793,
                                -0.0854555070400238,
                                -0.0964844822883606,
                                0.1819869577884674,
                                0.09594883769750595,
                                0.1476030796766281,
                                -0.0492919385433197,
                                -0.09563719481229782,
                                0.01389351300895214
                            ],
                            [
                                -0.16671687364578247,
                                0.09368862956762314,
                                0.32566678524017334,
                                -0.14959481358528137,
                                -0.11932804435491562,
                                -0.31095224618911743,
                                0.04460323229432106,
                                -0.22948057949543,
                                -0.16323111951351166,
                                -0.06378083676099777,
                                0.2776634693145752,
                                0.004131540190428495,
                                -0.08664292842149734,
                                0.05841023474931717,
                                -0.017010435461997986,
                                0.18357615172863007
                            ],
                            [
                                -0.04226083308458328,
                                0.2474721521139145,
                                0.2343256026506424,
                                0.030591310933232307,
                                -0.07218388468027115,
                                -0.04379580542445183,
                                -0.02149842493236065,
                                -0.14032720029354095,
                                -0.10594385862350464,
                                0.0016199032543227077,
                                0.23949360847473145,
                                0.010628323070704937,
                                -0.009919848293066025,
                                0.12558308243751526,
                                -0.05686093121767044,
                                0.06089433655142784
                            ],
                            [
                                -0.10878657549619675,
                                0.0474819652736187,
                                -0.045161955058574677,
                                0.12211013585329056,
                                0.1461268961429596,
                                0.11894652247428894,
                                0.0157485269010067,
                                -9.513500117463991e-06,
                                0.3044624328613281,
                                0.19127294421195984,
                                0.2635170519351959,
                                0.11682097613811493,
                                0.04017188400030136,
                                -0.1989302784204483,
                                -0.18469640612602234,
                                -0.04891538992524147
                            ],
                            [
                                0.0648297667503357,
                                -0.05158345028758049,
                                0.06904599070549011,
                                -0.1418703943490982,
                                -0.07534535974264145,
                                -0.12316354364156723,
                                -0.15466752648353577,
                                -0.021076073870062828,
                                -0.09247508645057678,
                                0.08687374740839005,
                                0.20812943577766418,
                                -0.0781712755560875,
                                0.13828514516353607,
                                -0.08603017032146454,
                                -0.16936421394348145,
                                -0.03407108038663864
                            ],
                            [
                                -0.021341273561120033,
                                0.04162946343421936,
                                -0.09333130717277527,
                                0.04312867298722267,
                                -0.07151336222887039,
                                -0.08277349919080734,
                                -0.10681574046611786,
                                0.16415618360042572,
                                0.018879104405641556,
                                -0.028576945886015892,
                                -0.18355624377727509,
                                -0.0033443842548877,
                                -0.024988848716020584,
                                0.02455112338066101,
                                -0.053380087018013,
                                -0.35966750979423523
                            ]
                        ],
                        [
                            [
                                -0.04427754878997803,
                                -0.10132516920566559,
                                0.08364084362983704,
                                -0.17228952050209045,
                                -0.16737909615039825,
                                -0.06671509891748428,
                                -0.09933730959892273,
                                -0.09325645864009857,
                                -0.05700384080410004,
                                -0.049425672739744186,
                                -0.017661454156041145,
                                0.06502275168895721,
                                0.0895787850022316,
                                0.03870281204581261,
                                -0.1766716092824936,
                                -0.140462726354599
                            ],
                            [
                                -0.11514078825712204,
                                -0.008362446911633015,
                                0.2000005841255188,
                                -0.12277331948280334,
                                -0.11290634423494339,
                                -0.24745725095272064,
                                0.006911837961524725,
                                0.07121505588293076,
                                -0.3109157383441925,
                                -0.026582874357700348,
                                0.10804015398025513,
                                0.08294349908828735,
                                -0.16775304079055786,
                                0.2598809599876404,
                                0.030853144824504852,
                                -0.021085679531097412
                            ],
                            [
                                0.035909369587898254,
                                0.23643039166927338,
                                0.1819453239440918,
                                -0.1367817223072052,
                                -0.21788550913333893,
                                0.02688613161444664,
                                -0.17675645649433136,
                                0.013705417513847351,
                                -0.13293445110321045,
                                0.07983008772134781,
                                0.05715229734778404,
                                0.020309820771217346,
                                0.0611315593123436,
                                0.15034909546375275,
                                0.0067599499598145485,
                                0.16899745166301727
                            ],
                            [
                                -0.1220858171582222,
                                0.20792241394519806,
                                0.11546600610017776,
                                -0.004394251387566328,
                                -0.005171387456357479,
                                0.04971202835440636,
                                -0.09388048201799393,
                                0.0025290672201663256,
                                0.05158594995737076,
                                0.25568199157714844,
                                0.10006766766309738,
                                -0.18478640913963318,
                                0.13632874190807343,
                                -0.23171986639499664,
                                -0.1444375365972519,
                                -0.06026875972747803
                            ],
                            [
                                0.07687292248010635,
                                0.03969592601060867,
                                0.09812471270561218,
                                -0.23088322579860687,
                                -0.16202515363693237,
                                0.021538136526942253,
                                -0.37628817558288574,
                                -0.03675590828061104,
                                -0.03525495156645775,
                                0.08808962255716324,
                                0.06941431760787964,
                                -0.08807484060525894,
                                0.15462739765644073,
                                -0.029656795784831047,
                                -0.28173086047172546,
                                0.12996214628219604
                            ],
                            [
                                -0.012163094244897366,
                                0.15469282865524292,
                                -0.12986716628074646,
                                -0.15681295096874237,
                                -0.15568210184574127,
                                0.029819194227457047,
                                -0.1692487597465515,
                                -0.05130721256136894,
                                0.0695900171995163,
                                -0.1849045306444168,
                                -0.3346216082572937,
                                -0.09188476204872131,
                                -0.06071719154715538,
                                0.013275783509016037,
                                0.10004278272390366,
                                -0.5522436499595642
                            ]
                        ],
                        [
                            [
                                -0.03703561797738075,
                                0.11549531668424606,
                                0.008191678673028946,
                                -0.14717021584510803,
                                -0.16835635900497437,
                                0.09148508310317993,
                                0.02292051538825035,
                                0.035876139998435974,
                                -0.11425327509641647,
                                -0.15082992613315582,
                                -0.09189865738153458,
                                -0.004222290590405464,
                                -0.052922774106264114,
                                0.09449487179517746,
                                -0.26963478326797485,
                                0.0005896622897125781
                            ],
                            [
                                0.01170988567173481,
                                -0.09426938742399216,
                                0.08436251431703568,
                                -0.08594416826963425,
                                0.018290584906935692,
                                -0.15335656702518463,
                                -0.03204454481601715,
                                -0.07431500405073166,
                                -0.12910227477550507,
                                -0.162530317902565,
                                0.12418226897716522,
                                -0.1332644671201706,
                                -0.2586692273616791,
                                0.275503009557724,
                                0.07596360146999359,
                                -0.5553690791130066
                            ],
                            [
                                -0.12805382907390594,
                                0.20277929306030273,
                                -0.03301816061139107,
                                -0.2283587008714676,
                                -0.30899742245674133,
                                -0.024691961705684662,
                                -0.12257988750934601,
                                0.1084742322564125,
                                -0.08995935320854187,
                                -0.048954077064991,
                                -0.08176806569099426,
                                -0.03381289914250374,
                                -0.12407025694847107,
                                -0.11581990867853165,
                                0.001588292419910431,
                                -0.2768317759037018
                            ],
                            [
                                -0.23351071774959564,
                                0.14486268162727356,
                                0.15344779193401337,
                                -0.15092116594314575,
                                -0.08314498513936996,
                                0.09604021906852722,
                                0.004996810108423233,
                                0.08009253442287445,
                                -0.07982438802719116,
                                0.14581255614757538,
                                -0.01772262156009674,
                                0.08959817886352539,
                                0.07442913949489594,
                                -0.11344102770090103,
                                -0.24244378507137299,
                                0.06581755727529526
                            ],
                            [
                                -0.003419593907892704,
                                0.002761892043054104,
                                0.08952275663614273,
                                -0.39116358757019043,
                                -0.21109655499458313,
                                0.047422148287296295,
                                -0.10657968372106552,
                                -0.0869319811463356,
                                -0.04162956029176712,
                                -0.017619304358959198,
                                -0.2959989309310913,
                                0.06526362895965576,
                                0.09447408467531204,
                                -0.05778827145695686,
                                -0.3276940584182739,
                                0.21394485235214233
                            ],
                            [
                                -0.13781331479549408,
                                0.24645531177520752,
                                -0.10899633169174194,
                                -0.20376326143741608,
                                -0.07976589351892471,
                                -0.023771753534674644,
                                0.00166815344709903,
                                0.06408416479825974,
                                0.06423307210206985,
                                -0.02022801898419857,
                                0.029998229816555977,
                                0.26587677001953125,
                                -0.04306605085730553,
                                0.12613463401794434,
                                0.07429797947406769,
                                0.04176788404583931
                            ]
                        ],
                        [
                            [
                                0.031112680211663246,
                                0.03312027081847191,
                                0.09426998347043991,
                                -0.13394513726234436,
                                -0.16158460080623627,
                                0.13500915467739105,
                                0.1044248715043068,
                                0.00823882780969143,
                                0.09786373376846313,
                                -0.11567044258117676,
                                0.05686287581920624,
                                0.1065266877412796,
                                0.04915960133075714,
                                0.18569764494895935,
                                -0.051103122532367706,
                                0.1085834726691246
                            ],
                            [
                                -0.04571067541837692,
                                0.14398948848247528,
                                0.059798259288072586,
                                -0.029409563168883324,
                                -0.011407413519918919,
                                0.06189259886741638,
                                0.13394223153591156,
                                -0.03650740906596184,
                                -0.139353945851326,
                                -0.09576993435621262,
                                0.08862429112195969,
                                0.061775222420692444,
                                -0.24198706448078156,
                                0.019331159070134163,
                                0.1391531229019165,
                                -0.2057187557220459
                            ],
                            [
                                0.056513622403144836,
                                0.07602059096097946,
                                -0.012546463869512081,
                                -0.14967434108257294,
                                -0.12706705927848816,
                                -0.053728342056274414,
                                0.07606778293848038,
                                0.09146157652139664,
                                -0.12522272765636444,
                                -0.13313615322113037,
                                -0.22404855489730835,
                                0.027047738432884216,
                                0.003172225086018443,
                                0.1122640073299408,
                                -0.22366048395633698,
                                0.0400906540453434
                            ],
                            [
                                -0.14957119524478912,
                                0.27287164330482483,
                                0.2089979648590088,
                                -0.27152520418167114,
                                0.03181660547852516,
                                -0.03657755255699158,
                                -0.14079074561595917,
                                0.13143834471702576,
                                0.1218404471874237,
                                -0.05106358602643013,
                                0.06888537108898163,
                                0.1960054188966751,
                                0.04495133459568024,
                                0.35282257199287415,
                                -0.30316072702407837,
                                0.07335449010133743
                            ],
                            [
                                -0.0066097150556743145,
                                -0.01731371134519577,
                                0.051383569836616516,
                                -0.1594730019569397,
                                -0.0391283854842186,
                                0.08400709182024002,
                                0.01898680254817009,
                                0.005966054741293192,
                                0.006113600451499224,
                                -0.05942957103252411,
                                -0.06543084233999252,
                                -0.03499079868197441,
                                -0.0005865607527084649,
                                0.2988763749599457,
                                -0.30707260966300964,
                                0.09767395257949829
                            ],
                            [
                                -0.3051600456237793,
                                0.20755454897880554,
                                -0.09792245924472809,
                                0.09303192794322968,
                                -0.1595381796360016,
                                0.05907699465751648,
                                -0.015778696164488792,
                                0.2936764359474182,
                                0.16200333833694458,
                                -0.21159961819648743,
                                0.12087342888116837,
                                0.18312613666057587,
                                0.02611123025417328,
                                0.2250145971775055,
                                0.15428532660007477,
                                0.11416833847761154
                            ]
                        ],
                        [
                            [
                                -0.0795353502035141,
                                -0.09186644107103348,
                                -0.032123588025569916,
                                0.061387743800878525,
                                -0.18109330534934998,
                                0.07831843942403793,
                                0.035920675843954086,
                                0.06186039373278618,
                                0.1151902973651886,
                                -0.16068300604820251,
                                0.18246395885944366,
                                -0.13107305765151978,
                                0.03565700724720955,
                                0.06286436319351196,
                                -0.10052112489938736,
                                0.026345396414399147
                            ],
                            [
                                -0.18739204108715057,
                                0.011632014065980911,
                                -0.0920415148139,
                                -0.16578243672847748,
                                -0.21729856729507446,
                                0.05235132575035095,
                                0.29608768224716187,
                                0.0883815661072731,
                                -0.24139650166034698,
                                -0.0157050471752882,
                                -0.07855559885501862,
                                0.3697175979614258,
                                -0.16896064579486847,
                                -0.14107051491737366,
                                -0.09756414592266083,
                                -0.05114069581031799
                            ],
                            [
                                -0.15319383144378662,
                                0.1333206444978714,
                                -0.018251800909638405,
                                0.03956518694758415,
                                -0.1932734102010727,
                                0.014162114821374416,
                                0.03703822195529938,
                                0.24405249953269958,
                                -0.01353279035538435,
                                -0.09428390115499496,
                                0.15884603559970856,
                                0.3081294894218445,
                                0.014097929000854492,
                                0.16088484227657318,
                                -0.01232423260807991,
                                0.2266358733177185
                            ],
                            [
                                0.028272662311792374,
                                0.3123554289340973,
                                0.1891823261976242,
                                -0.21254239976406097,
                                0.1190442144870758,
                                -0.1425013691186905,
                                -0.004469848237931728,
                                0.45638570189476013,
                                0.23976954817771912,
                                -0.038285162299871445,
                                0.11813324689865112,
                                0.28492844104766846,
                                -0.08781712502241135,
                                0.3996208906173706,
                                -0.26120707392692566,
                                0.14359444379806519
                            ],
                            [
                                0.0077297268435359,
                                0.03634539991617203,
                                0.013394028879702091,
                                -0.17841686308383942,
                                -0.19048553705215454,
                                0.10819156467914581,
                                -0.016915680840611458,
                                0.15034127235412598,
                                0.11975839734077454,
                                0.008239311166107655,
                                0.25440067052841187,
                                -0.18145228922367096,
                                -0.04025205597281456,
                                0.18307526409626007,
                                -0.11017924547195435,
                                0.15496550500392914
                            ],
                            [
                                -0.040025901049375534,
                                0.2373734712600708,
                                -0.19662541151046753,
                                0.30766403675079346,
                                -0.23587609827518463,
                                0.016167549416422844,
                                -0.14082764089107513,
                                0.05021384730935097,
                                0.05301141366362572,
                                -0.07580645382404327,
                                0.24158331751823425,
                                -0.2884518802165985,
                                0.07697898149490356,
                                0.11578721553087234,
                                0.13171282410621643,
                                -0.13222116231918335
                            ]
                        ]
                    ],
                    [
                        [
                            [
                                -0.1971258968114853,
                                -0.10027468949556351,
                                0.03363742679357529,
                                -0.010081606917083263,
                                -0.013874941505491734,
                                -0.07222278416156769,
                                -0.15588465332984924,
                                0.055159736424684525,
                                0.024051982909440994,
                                0.04245012253522873,
                                0.19483616948127747,
                                -0.130031019449234,
                                0.08378113061189651,
                                -0.06945667415857315,
                                -0.21107828617095947,
                                -0.054056402295827866
                            ],
                            [
                                -0.08334337919950485,
                                0.08981626480817795,
                                0.32850831747055054,
                                0.05475530028343201,
                                0.08183734863996506,
                                -0.22634130716323853,
                                0.004078255034983158,
                                0.19847753643989563,
                                -0.11457955837249756,
                                -0.018144216388463974,
                                0.2137249857187271,
                                0.04318268597126007,
                                -0.01419260073453188,
                                0.09231466799974442,
                                0.03370210900902748,
                                0.1191103607416153
                            ],
                            [
                                -0.059938035905361176,
                                0.027019595727324486,
                                0.03539819270372391,
                                0.0709482878446579,
                                -0.10968425869941711,
                                0.026959896087646484,
                                -0.07917611300945282,
                                -0.029782792553305626,
                                0.21860241889953613,
                                0.00687946192920208,
                                0.2516558766365051,
                                0.058789197355508804,
                                0.14508554339408875,
                                0.011676180176436901,
                                0.16298852860927582,
                                0.031232262030243874
                            ],
                            [
                                -0.297023206949234,
                                -0.24342308938503265,
                                -0.2603992819786072,
                                0.08050776273012161,
                                0.07909296452999115,
                                0.16849428415298462,
                                0.017279677093029022,
                                0.015477088280022144,
                                0.24004769325256348,
                                -0.03068910725414753,
                                0.2746550738811493,
                                -0.08691200613975525,
                                0.15353025496006012,
                                -0.1474725902080536,
                                0.0718701183795929,
                                -0.09152457863092422
                            ],
                            [
                                -0.024908769875764847,
                                -0.1062205582857132,
                                -0.0619983933866024,
                                0.02769003063440323,
                                -0.08360849320888519,
                                0.1042691245675087,
                                -0.06484469026327133,
                                -0.08124355226755142,
                                0.025862829759716988,
                                0.13812825083732605,
                                0.1747438609600067,
                                -0.09652184695005417,
                                -0.0031126290559768677,
                                -0.09464620053768158,
                                -0.2854011654853821,
                                0.014075525104999542
                            ],
                            [
                                -0.16033151745796204,
                                -0.07147582620382309,
                                -0.17740745842456818,
                                -0.04462475702166557,
                                -0.11837765574455261,
                                0.009496204555034637,
                                0.05386573076248169,
                                0.13177523016929626,
                                -0.02925911918282509,
                                0.0774320736527443,
                                -0.2263544499874115,
                                -0.04645681381225586,
                                -0.1814616322517395,
                                -0.2887457013130188,
                                -0.3150981366634369,
                                -0.47185200452804565
                            ]
                        ],
